# Задача 2: Найдите сумму цифр трехзначного числа.
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

number = int(input("Введите целое трехзначное число: "))
if (number < 100 or number > 999):
    print ("Это не трехзначное число!")
else:
    print(f'Сумма цифр числа {number} -> {number//100+(number//10%10)+(number%10)} ({number//100} + {number//10%10} + {number%10})')
