# Определить индексы элементов массива (списка),
# значения которых принадлежат заданному диапазону (т.е. не
# меньше заданного минимума и не больше заданного
# максимума)
# Ввод: [-5, 9, 0, 3, -1, -2, 1,
# 4, -2, 10, 2, 0, -9, 8, 10, -9,
# 0, -5, -5, 7]
# Вывод: [1, 9, 13, 14, 19]

# import random
# n = int(input('Введите количество элементов последовательности: '))
# minn = int(input('Введите начало диапазона: '))
# maxx = int(input('Введите конец диапазона: '))
# list_1 = []
# list_2 = []
# for i in range(n):
#     list_1.append(random.randint(-50, 50))
#     if minn <= list_1[i] <= maxx:
#         list_2.append(i)
# print(list_1)
# print(list_2)

list_1 = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
minn = int(input('Введите начало диапазона: '))
maxx = int(input('Введите конец диапазона: '))
print(list_1)
print(f'Индексы чисел больше {minn} и меньше {maxx}:\n{[i for i in range(len(list_1)) if minn <= list_1[i] <= maxx]}')

